<p>由于po文件本身就是一个文本文件，所以任何文本编辑器都可以使用。</p>
 <p>还有一款poEdit产品，可以很专业的莱编辑po文件。poEdit可以将现有的po与新的pot自动进行比较，并标识­出不同来。
 并且poEdit的Catalog/Update catalog命令可以将现有的po与pot（其实也可以是po­）进行比较更新。<br />
 </p>
 <p>
 对于初级玩家，找一款支持语法加亮的编辑器就可以了。这里推荐使用EditPlus或者UltraEdit。可以在EditPlus里面新建一个po文件的格式，并且定义一下语法加亮规则。以#开头的行都是注释行，用不同颜色显示一下就可以了。至于UltraEdit也是一样的。</p>
 <p>
 对于习惯使用vi的人来说，也可以使用gvim，直接支持语法加亮的。但是，在windows下面，我的gvim不支持utf-8编码，仅仅支持本地编码，就是gb2312，这给编辑utf-8编码的文件带来较大的麻烦。</p>
 <p>总的来说，如果你是像潘老大那样搞专业汉化的，请使用poEdit，而如果像我这样学习研究的，就找一款自己用的熟悉的文本编辑器就可以了。</p>