
 <p>用Plone作我们自己的内部网站项目的过程真是很艰辛，使我开始对plone企业应用的成熟性产生了一些怀疑。</p>
 <p>1、关于Zope&amp;Plone的文档比较缺乏</p>
 <p>
 &nbsp;　　真正着手开始项目的时候才发现探索的过程太艰辛，文档资料太缺乏（特别是中文）。直到现在我还是不知道如何创建一个自己的product。也许我的水平有限，但相比其他的平台如iis等，Zope&amp;Plone感觉还是太难入手了。</p>
 <p>2、缺少快速的开发工具</p>
 <p>
 　　没有好的快速开发工具。在希望定制一个完全不同的外观时，这个缺点导致的大量代码编辑工作足以使大部分人退却。我们的网站项目组中的六个人最后只有一个人愿意和我一起编辑调试模版文件，调试那些CSS
 。最终我放弃了制作多个Skin的打算。</p>
 <p>3、系统的性能不佳</p>
 <p>
 　　速度太慢，即使是安装了SpeedPak。在我们正式启用网站的第一个上午它就崩溃了，而我们也只有200多个客户端而已。我们不得不推迟启用，并临时更换了性能更好的服务器。而同样的服务器可以稳定运行有150多个用户的Domino系统。当然，我们使用的只是Windows版本的Plone，也许linux下的plone性能会好一些。</p>
 <p>&nbsp;</p>
 <p>　　其实我觉得上面提到的第一点是它最大的软肋，会限制它的推广和应用。如果没人买账，再好的东西也会消亡的。</p>
 <p>&nbsp;</p>
 <p>&nbsp;</p>
