<p>
 　　打击！在我不完全知情的情况，网站项目组测试了另一套内容管理系统，并开始筹划替换现有的ｐｌｏｎｅ系统，已经导完了大部分数据，并对部分内容编辑作了培训！从整个实施过程来看，这应当是经过了信息部经理的默许的。</p>
 <p>
 　　虽然我作为一个内容主编对选用何种系统没有决策权，且一直都认为只要系统能满足我的需要，不管是什么系统我都是能接受的，但毕竟ｐｌｏｎｅ系统是我极力推荐的，更难以理解的是测试用来替换的系统只是一个功能远远不如ｐｌｏｎｅ的简单ａｓｐ文章管理系统而已。这使我不得不认真地进行反思。</p>
 <p>
 　　最大的失误是没能完全取得关键人物——网站项目组负责人——的充分支持。虽然我曾争取到了具有决策权的人物——信息部经理——的支持，但很明显ｐｌｏｎｅ系统的运作没能满足他的期望。由于缺乏网站项目组技术人员的支持，我向他所介绍过的许多ｐｌｏｎｅ系统的优点没能展示出来，而开源系统不稳定可靠的一贯偏见在经历了系统第一次启用就当机的事件后更在他的思想中根深蒂固了，再加上网站项目组对ｐｌｏｎｅ并不积极的态度，使得他不得不考虑用其他系统来实现他所期望得到的效果。</p>
 <p>　　我想可能是这几点拙劣的表现影响了他的决策：<br />
 　　１、ｐｌｏｎｅ系统在我们服务器上的缓慢响应速度；<br />
 　　２、虽经定制但仍很“难看”的外观；<br />
 　　３、规划不合理的信息组织方式；</p>
 <p>　　我该怎么办？我并不想让ｐｌｏｎｅ就这样在我的公司里消失，可是争取不到足够支持，我还能有什么挽救的办法么？</p>
 <p>　　</p>