
 <p>&nbsp;&nbsp;&nbsp; 没有比公司停电更让程序员幸福的了。昨天公司停电。<br />
 &nbsp;&nbsp;&nbsp; 得到停电通知的时候已经是下午了，我平静地敲下回车。一个勉勉强强半死不活的程序就开始跑了起来。<br />
 &nbsp;&nbsp;&nbsp; 哦，我是搞人工智能的，人工智能并不是总是充满激情的，比如有时候要分析好几 G
 的数据，假如分析程序又象我写得那样低效率，那么整件事情就会变得很沉闷。<br />
 &nbsp;&nbsp;&nbsp; 我开始写我在 CZUG 上的第一篇 Blog，这个过程一直持续到早上 4
 点多。通常我会在晚上两三点睡觉，因为早上还要上班，不过现在不必了，因为公司停电。<br />
 &nbsp;&nbsp;&nbsp; 四点钟，回过头来测试程序，全部失败。<br />
 &nbsp;&nbsp;&nbsp; 五点多，打开盗版魔兽连到上海专区，玩了三局，两胜一平。<br />
 &nbsp;&nbsp;&nbsp; 七点我决定回家，有点困。如果交通靠走的话，回家需要 30 分钟。打的需要 8
 ￥。于是我决定睁着睡眼惺忪走回去。<br />
 &nbsp;&nbsp;&nbsp;
 行置两三里，遇上一家包子店，于是决定吃早饭。排了会队，没买到；于是换了个位置，买到两菜一肉包。付钱，转过身突然发现眼镜被蒸笼烟得白茫茫得一片，什么都看不见了。包子的面香充斥了整个世界。<br />
 &nbsp;&nbsp;&nbsp; 这一瞬间，我突然发现自己原来是世界上最幸福的人了！有诗为证：</p>
 <div align="center">
 摸黑捣到七八点，<br />
 睁眼返至两三里。<br />
 忽闻灶笼白面香，<br />
 不觉竹烟入镜景。<br />
 <div align="left">
 &nbsp;&nbsp;&nbsp; 我想趁机作些诗，就叫做《IT 公司停电赋》吧，但是发现无韵可压，于是草草了事。<br />
 &nbsp;&nbsp;&nbsp; 这种幸福的感觉够我回味一段时间了。
 </div>
 </div>
